# ***Class: 2_25***
### Pandas!

In [1]:
import pandas as pd #libary of functions. tables.

In [9]:
d = {'id':[1,2,3,4],
     'name':['danny', 'shir','haim','gil'],
     'age':[30,40,50,35] , 
     'courses':['A','B','A','B']
     }

d

{'id': [1, 2, 3, 4],
 'name': ['danny', 'shir', 'haim', 'gil'],
 'age': [30, 40, 50, 35],
 'courses': ['A', 'B', 'A', 'B']}

In [3]:
d['age']

[30, 40, 50, 35]

In [11]:
df = pd.DataFrame(d)

In [12]:
df[0:3]

   id   name  age courses
0   1  danny   30       A
1   2   shir   40       B
2   3   haim   50       A

In [8]:
df[['name', 'age']]

    name  age
0  danny   30
1   shir   40
2   haim   50
3    gil   35

In [13]:
def_courses = df.groupby('courses', as_index=False).agg({'age':'mean'})
def_courses

  courses   age
0       A  40.0
1       B  37.5

In [15]:
import matplotlib.pyplot as plt

In [16]:
df

   id   name  age courses
0   1  danny   30       A
1   2   shir   40       B
2   3   haim   50       A
3   4    gil   35       B

In [17]:
type(df)

pandas.core.frame.DataFrame

In [19]:
s = df['age'] #series

In [20]:
type(s)

pandas.core.series.Series

In [24]:
s2 = df.loc[1] #location

In [25]:
type(s2)

pandas.core.series.Series

In [27]:
list(s2.index)

['id', 'name', 'age', 'courses']

In [28]:
df[1:3]

   id  name  age courses
1   2  shir   40       B
2   3  haim   50       A

In [30]:
df.age.describe()

count     4.000000
mean     38.750000
std       8.539126
min      30.000000
25%      33.750000
50%      37.500000
75%      42.500000
max      50.000000
Name: age, dtype: float64

In [31]:
df

   id   name  age courses
0   1  danny   30       A
1   2   shir   40       B
2   3   haim   50       A
3   4    gil   35       B

In [35]:
x = df.age >  35
x

0    False
1     True
2     True
3    False
Name: age, dtype: bool

In [36]:
df[x]

   id  name  age courses
1   2  shir   40       B
2   3  haim   50       A

In [38]:
df.head(2) # returns the top of the table

   id   name  age courses
0   1  danny   30       A
1   2   shir   40       B

In [39]:
df.tail(2) #bottoms

   id  name  age courses
2   3  haim   50       A
3   4   gil   35       B

In [40]:
df.describe()

             id        age
count  4.000000   4.000000
mean   2.500000  38.750000
std    1.290994   8.539126
min    1.000000  30.000000
25%    1.750000  33.750000
50%    2.500000  37.500000
75%    3.250000  42.500000
max    4.000000  50.000000

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       4 non-null      int64
 1   name     4 non-null      object
 2   age      4 non-null      int64
 3   courses  4 non-null      object
dtypes: int64(2), object(2)
memory usage: 256.0+ bytes

In [44]:
df.sort_values(ascending=False, by='name') #decending -> watch out for capitalized stringles. eg. in this case capital name would be on the bottom

   id   name  age courses
1   2   shir   40       B
2   3   haim   50       A
3   4    gil   35       B
0   1  danny   30       A

In [45]:
df.to_numpy()

array([[1, 'danny', 30, 'A'],
       [2, 'shir', 40, 'B'],
       [3, 'haim', 50, 'A'],
       [4, 'gil', 35, 'B']], dtype=object)

In [48]:
df[['id', 'age']].mean()

id      2.50
age    38.75
dtype: float64

In [49]:
df.dtypes #attributes

id          int64
name       object
age         int64
courses    object
dtype: object

In [50]:
df.columns

Index(['id', 'name', 'age', 'courses'], dtype='object')

In [51]:
df.values

array([[1, 'danny', 30, 'A'],
       [2, 'shir', 40, 'B'],
       [3, 'haim', 50, 'A'],
       [4, 'gil', 35, 'B']], dtype=object)

# **Selecting & Slicing & filtering**

In [52]:
df['id']

0    1
1    2
2    3
3    4
Name: id, dtype: int64

In [53]:
df['name'] #can not put in rage ['blah':'blah]

0    danny
1     shir
2     haim
3      gil
Name: name, dtype: object

In [54]:
df[2:4] #slicing

   id  name  age courses
2   3  haim   50       A
3   4   gil   35       B

In [55]:
df[0:1]

   id   name  age courses
0   1  danny   30       A

In [56]:
type(df[0:1]) #dataframe because I asked a range then something specific

pandas.core.frame.DataFrame

In [57]:
df[4:0] #because of the 0

Empty DataFrame
Columns: [id, name, age, courses]
Index: []

In [58]:
df[4:0:-1]

   id  name  age courses
3   4   gil   35       B
2   3  haim   50       A
1   2  shir   40       B

In [59]:
df[df['id']==3]

   id  name  age courses
2   3  haim   50       A

In [63]:
df[ (df['age'] > 30) & (df['courses']=='B') ]

   id  name  age courses
1   2  shir   40       B
3   4   gil   35       B

In [65]:
df [  ~ df['age'].isin([40,35])] #the sigly line is not in

   id   name  age courses
0   1  danny   30       A
2   3   haim   50       A

In [66]:
df.loc[10] = [11, 'shir',None,True]
df

    id   name   age courses
0    1  danny    30       A
1    2   shir    40       B
2    3   haim    50       A
3    4    gil    35       B
10  11   shir  None    True

In [67]:
df['age'].isnull()

0     False
1     False
2     False
3     False
10     True
Name: age, dtype: bool

In [68]:
df[df['age'].isnull()] #or .notna

    id  name   age courses
10  11  shir  None    True

## .loc and .iloc

In [69]:
df.loc[2:4,['name', 'age']] #works on label returns 2, 3 , 4

   name age
2  haim  50
3   gil  35

In [72]:
df.loc[2:4,'name' : 'courses'] #gives a range -> row and coloumn

   name age courses
2  haim  50       A
3   gil  35       B

In [76]:
df.iloc[2:4,:]

   id  name age courses
2   3  haim  50       A
3   4   gil  35       B

In [77]:
df.iloc[2:4,[0,2]]

   id age
2   3  50
3   4  35

In [78]:
df.at[3,"name"]

'gil'

In [79]:
#

   # loc gets rows (and/or columns) with particular labels.

   # iloc gets rows (and/or columns) at integer locations.
#

## dot operator .

In [80]:
df.id

0      1
1      2
2      3
3      4
10    11
Name: id, dtype: int64

In [81]:
df.age

0       30
1       40
2       50
3       35
10    None
Name: age, dtype: object

In [82]:
df[df.id>3]

    id  name   age courses
3    4   gil    35       B
10  11  shir  None    True

## Series

In [83]:
se = pd.Series([1,5,8,3])

In [84]:
se[0]

1

In [85]:
se[1]

5

In [86]:
se[0:3]

0    1
1    5
2    8
dtype: int64

In [ ]:
se = pd.Series([1,5,8,3, index =])

In [ ]:
se = pd.Series({"a":1, "b":2})

In [87]:
pwd

'c:\\Users\\yosef\\OneDrive\\Desktop\\TBDA\\Class\\Python\\Class_Notes'